In [1]:
#Basic operations that can be appilied on a pandas Data Frame are as shown below:
#Creating a Data Frame.
#Performing operations on Rows and Columns.
#Data Selection, addition, deletion.
#Working with missing data.
#Renaming the Columns or Indices of a DataFrame.

In [2]:
import pandas as pd

In [3]:
#Creating a Data Frame.

df=pd.DataFrame(data=({"Name":['Ashika', 'Tanu', 'Ashwin', 'Mohit', 'Sourabh'], 
       
       "Age":[24, 23, 22, 19, 10]}))
df.head()

      Name  Age
0   Ashika   24
1     Tanu   23
2   Ashwin   22
3    Mohit   19
4  Sourabh   10

In [4]:
#Performing operations on Rows and Columns.

#selecting a column
df[["Name"]]

      Name
0   Ashika
1     Tanu
2   Ashwin
3    Mohit
4  Sourabh

In [5]:
#selecting a row
df.loc[0]

Name    Ashika
Age         24
Name: 0, dtype: object

In [6]:
#Data Selection, addition, deletion.
#deleting a column

del df["Age"]
df

      Name
0   Ashika
1     Tanu
2   Ashwin
3    Mohit
4  Sourabh

In [7]:
df.insert(1, "name", df["Name"])
df

      Name     name
0   Ashika   Ashika
1     Tanu     Tanu
2   Ashwin   Ashwin
3    Mohit    Mohit
4  Sourabh  Sourabh

In [8]:
del df["name"]
df

      Name
0   Ashika
1     Tanu
2   Ashwin
3    Mohit
4  Sourabh

In [9]:
#Working with missing data.

import numpy as np
df=pd.DataFrame({"Name":['Tanu', np.nan], "Age":[23, np.nan]})
df

   Name   Age
0  Tanu  23.0
1   NaN   NaN

In [10]:
df.fillna(0)

   Name   Age
0  Tanu  23.0
1     0   0.0

In [11]:
#Renaming the Columns or Indices of a DataFrame.

df
new_cols={"Name": "NAME", "Age": "AGE"}
df.rename(columns=new_cols, inplace=True)
df

   NAME   AGE
0  Tanu  23.0
1   NaN   NaN

In [13]:
#renaming indices

new_index={0:"a", 1:"b"}
df.rename(index=newindex)

NameError: name 'newindex' is not defined